ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR1986VK01/DeviceSupport/startup/iar/startup_MDR1986VK01.s
        PUBWEAK UsageFault_Handler
        SECTION .text:CODE:NOROOT(1)
UsageFault_Handler
        B UsageFault_Handler

        PUBWEAK SVC_Handler
        SECTION .text:CODE:NOROOT(1)
SVC_Handler
        B SVC_Handler

        PUBWEAK DebugMon_Handler
        SECTION .text:CODE:NOROOT(1)
DebugMon_Handler
        B DebugMon_Handler

        PUBWEAK PendSV_Handler
        SECTION .text:CODE:NOROOT(1)
PendSV_Handler
        B PendSV_Handler

        PUBWEAK SysTick_Handler
        SECTION .text:CODE:NOROOT(1)
SysTick_Handler
        B SysTick_Handler

        PUBWEAK FT_IF0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
FT_IF0_IRQHandler
        B FT_IF0_IRQHandler

        PUBWEAK FT_IF1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
FT_IF1_IRQHandler
        B FT_IF1_IRQHandler

        PUBWEAK FT_IF2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
FT_IF2_IRQHandler
        B FT_IF2_IRQHandler

        PUBWEAK FT_IF3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
FT_IF3_IRQHandler
        B FT_IF3_IRQHandler

        PUBWEAK CLK_IF_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CLK_IF_IRQHandler
        B CLK_IF_IRQHandler
	
	PUBWEAK RTC_IF_IRQHandler
        SECTION .text:CODE:NOROOT(1)
RTC_IF_IRQHandler
        B RTC_IF_IRQHandler

        PUBWEAK BKP_IF_IRQHandler
        SECTION .text:CODE:NOROOT(1)
BKP_IF_IRQHandler
        B BKP_IF_IRQHandler

        PUBWEAK EXT_INTERROR0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EXT_INTERROR0_IRQHandler
        B EXT_INTERROR0_IRQHandler

        PUBWEAK EXT_INTERROR1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EXT_INTERROR1_IRQHandler
        B EXT_INTERROR1_IRQHandler

        PUBWEAK EXT_INTERROR2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EXT_INTERROR2_IRQHandler
        B EXT_INTERROR2_IRQHandler

        PUBWEAK EXT_INTERROR3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EXT_INTERROR3_IRQHandler
        B EXT_INTERROR3_IRQHandler

        PUBWEAK EXT_INTERROR4_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EXT_INTERROR4_IRQHandler
        B EXT_INTERROR4_IRQHandler

        PUBWEAK EXT_INTERROR5_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EXT_INTERROR5_IRQHandler
        B EXT_INTERROR5_IRQHandler

        PUBWEAK EXT_INTERROR6_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EXT_INTERROR6_IRQHandler
        B EXT_INTERROR6_IRQHandler

        PUBWEAK EXT_INTERROR7_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EXT_INTERROR7_IRQHandler
        B EXT_INTERROR7_IRQHandler

        PUBWEAK IF_ERR_SCR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
IF_ERR_SCR_IRQHandler
        B IF_ERR_SCR_IRQHandler

        PUBWEAK IF_FIN_SCR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
IF_FIN_SCR_IRQHandler
        B IF_FIN_SCR_IRQHandler

        PUBWEAK DMA_ERR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_ERR_IRQHandler
        B DMA_ERR_IRQHandler

        PUBWEAK DMA_DONE0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE0_IRQHandler
        B DMA_DONE0_IRQHandler

        PUBWEAK DMA_DONE1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE1_IRQHandler
        B DMA_DONE1_IRQHandler

        PUBWEAK DMA_DONE2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE2_IRQHandler
        B DMA_DONE2_IRQHandler

        PUBWEAK DMA_DONE3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE3_IRQHandler
        B DMA_DONE3_IRQHandler

        PUBWEAK DMA_DONE4_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE4_IRQHandler
        B DMA_DONE4_IRQHandler

        PUBWEAK DMA_DONE5_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE5_IRQHandler
        B DMA_DONE5_IRQHandler

        PUBWEAK DMA_DONE6_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE6_IRQHandler
        B DMA_DONE6_IRQHandler

        PUBWEAK DMA_DONE7_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE7_IRQHandler
        B DMA_DONE7_IRQHandler

        PUBWEAK DMA_DONE8_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE8_IRQHandler
        B DMA_DONE8_IRQHandler

        PUBWEAK DMA_DONE9_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE9_IRQHandler
        B DMA_DONE9_IRQHandler

        PUBWEAK DMA_DONE10_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE10_IRQHandler
        B DMA_DONE10_IRQHandler

        PUBWEAK DMA_DONE11_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE11_IRQHandler
        B DMA_DONE11_IRQHandler

        PUBWEAK DMA_DONE12_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE12_IRQHandler
        B DMA_DONE12_IRQHandler

        PUBWEAK DMA_DONE13_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE13_IRQHandler
        B DMA_DONE13_IRQHandler

        PUBWEAK DMA_DONE14_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE14_IRQHandler
        B DMA_DONE14_IRQHandler

        PUBWEAK DMA_DONE15_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE15_IRQHandler
        B DMA_DONE15_IRQHandler

        PUBWEAK DMA_DONE16_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE16_IRQHandler
        B DMA_DONE16_IRQHandler

        PUBWEAK DMA_DONE17_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE17_IRQHandler
        B DMA_DONE17_IRQHandler

        PUBWEAK DMA_DONE18_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE18_IRQHandler
        B DMA_DONE18_IRQHandler

        PUBWEAK DMA_DONE19_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE19_IRQHandler
        B DMA_DONE19_IRQHandler

        PUBWEAK DMA_DONE20_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE20_IRQHandler
        B DMA_DONE20_IRQHandler

        PUBWEAK DMA_DONE21_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE21_IRQHandler
        B DMA_DONE21_IRQHandler

        PUBWEAK DMA_DONE22_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE22_IRQHandler
        B DMA_DONE22_IRQHandler

        PUBWEAK DMA_DONE23_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE23_IRQHandler
        B DMA_DONE23_IRQHandler

        PUBWEAK DMA_DONE24_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE24_IRQHandler
        B DMA_DONE24_IRQHandler

